<script setup>

import RulesComponent from "@/components/RulesComponent.vue";
const rules = [
  "При составлении задачи реккомендуется явно указывать переменные, которые будут на входе. Например, хорошо начать описание задачи со слов \"На вход задачи подаются переменные m,k\".",
  "Указываете явно, что должно выводить программа.",
  "Задачу формулируете кратко, четко и понятно. Не реккомендуется использовать тексты, контекст, который не относится к условию задачи.",
  "Если не получается получить результат с GigaChat, используйте Gigachat-Plus, иначе используйте модель GigaChat-Max.",
  "Помните, что нейронная модель может ошибаться, поэтому самостоятельно проверяйте тесты, которые она сгенерировала - они могут быть ошибочны.",
  "При проверке кода не забывайте об отступах, когда пишете на языке Python."
]
</script>

<template>
<RulesComponent :rules="rules"/>
</template>

<style scoped>

</style>